# Manipulate data with `dplyr`

---

## Fundamentals of ETL: data extraction, transformation and loading


Applied Mathematical Modeling in Banking

---

# Table of contents

1.What's `dplyr`
2. Exploring our data with dplyr `dplyr`

---

# 1.What's `dplyr`

The `dplyr` package is one of the most powerful and popular package in `R` for data manipulation.

Working with data:

- [x] Figure out what you want to do.
- [x] Describe those tasks in the form of a computer program.
- [x] Execute the program.

The `dplyr` package makes these steps fast and easy:

- [x] By constraining your options, it helps you think about your data manipulation challenges.
- [x] It provides simple `verbs`, functions that correspond to the most common data manipulation tasks, to help you translate your thoughts into code.
- [x] It uses efficient backends, so you spend less time waiting for the computer.

Before use you should install package:

In [11]:
#install.packages("dplyr")

Next step is loading package:

In [4]:
library(dplyr)

`dplyr` functions work with pipes and expect `tidy data`. In tidy data:

![](assets/images/03/dplyr1.png)

Alternative way is to load `tidyverse` package with other attached:

In [6]:
#install.packages("tidyverse")
library(tidyverse)
# to tidyverse attached packages
tidyverse_packages(include_self = TRUE)
# зачем это знать?..

Your code contains a unicode char which cannot be displayed in your
current locale and R will silently convert it to an escaped form when the
R kernel executes this code. This can lead to subtle errors if you use
such chars to do comparisons. For more information, please see
https://github.com/IRkernel/repr/wiki/Problems-with-unicode-on-windows

 [1] "broom"         "cli"           "crayon"        "dbplyr"
 [5] "dplyr"         "dtplyr"        "forcats"       "googledrive"
 [9] "googlesheets4" "ggplot2"       "haven"         "hms"
[13] "httr"          "jsonlite"      "lubridate"     "magrittr"
[17] "modelr"        "pillar"        "purrr"         "readr"
[21] "readxl"        "reprex"        "rlang"         "rstudioapi"
[25] "rvest"         "stringr"       "tibble"        "tidyr"
[29] "xml2"          "tidyverse"

---

# 2. Exploring our data with dplyr `dplyr`

## 2.1. Funtions and dataset explore

There are most popular functions in `dplyr` is listed in table.

|dplyr Function|Description	| Equivalent SQL|
|---|---|---|
|select()	|Selecting columns (variables)	|SELECT|
|filter()	|Filter (subset) rows.	|WHERE|
|group_by()|	Group the data	|GROUP BY|
|summarise()|	Summarise (or aggregate) data|	-|
|arrange()|	Sort the data	|ORDER BY
|join()|	Joining data frames (tables)|	JOIN|
|mutate()	|Creating New Variables|	COLUMN ALIAS|

For the next sample we are going to use `gapminder` dataset. [Go to gapminder dataset description](00_Datasets.ipynb#gapminder)

The `gapminder` data frame include six variables:


|variable|meaning|
|---|---|
|country| - |	
|continent| - |		
|year| - |	
|lifeExp|	life expectancy at birth|
|pop	|total population|
|gdpPercap|	per-capita GDP|

`Per-capita GDP` (Gross domestic product) is given in units of international dollars, `a hypothetical unit of currency that has the same purchasing power parity that the U.S. dollar had in the United States at a given point in time` – 2005, in this case.

The `gapminder` data frame is a special kind of data frame: a `tibble`.

In [8]:
library(gapminder)  # load package and dataset
class(gapminder)

Warning message:
"package 'gapminder' was built under R version 4.1.0"

[1] "tbl_df"     "tbl"        "data.frame"

Let's preview it with functions `str()`, `glimpse()`, `head()`, `tail()`, `summary()`.

In [9]:
str(gapminder)

tibble [1,704 x 6] (S3: tbl_df/tbl/data.frame)
 $ country  : Factor w/ 142 levels "Afghanistan",..: 1 1 1 1 1 1 1 1 1 1 ...
 $ continent: Factor w/ 5 levels "Africa","Americas",..: 3 3 3 3 3 3 3 3 3 3 ...
 $ year     : int [1:1704] 1952 1957 1962 1967 1972 1977 1982 1987 1992 1997 ...
 $ lifeExp  : num [1:1704] 28.8 30.3 32 34 36.1 ...
 $ pop      : int [1:1704] 8425333 9240934 10267083 11537966 13079460 14880372 12881816 13867957 16317921 22227415 ...
 $ gdpPercap: num [1:1704] 779 821 853 836 740 ...

In [10]:
glimpse(gapminder)

Rows: 1,704
Columns: 6
$ country   <fct> "Afghanistan", "Afghanistan", "Afghanistan", "Afghanistan", ~
$ continent <fct> Asia, Asia, Asia, Asia, Asia, Asia, Asia, Asia, Asia, Asia, ~
$ year      <int> 1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, ~
$ lifeExp   <dbl> 28.801, 30.332, 31.997, 34.020, 36.088, 38.438, 39.854, 40.8~
$ pop       <int> 8425333, 9240934, 10267083, 11537966, 13079460, 14880372, 12~
$ gdpPercap <dbl> 779.4453, 820.8530, 853.1007, 836.1971, 739.9811, 786.1134, ~

In [11]:
head(gapminder) #shows first n-rows, 6 by default

  country     continent year lifeExp pop      gdpPercap
1 Afghanistan Asia      1952 28.801   8425333 779.4453
2 Afghanistan Asia      1957 30.332   9240934 820.8530
3 Afghanistan Asia      1962 31.997  10267083 853.1007
4 Afghanistan Asia      1967 34.020  11537966 836.1971
5 Afghanistan Asia      1972 36.088  13079460 739.9811
6 Afghanistan Asia      1977 38.438  14880372 786.1134

In [12]:
tail(gapminder) #shows last n-rows, 6 by default

  country  continent year lifeExp pop      gdpPercap
1 Zimbabwe Africa    1982 60.363   7636524 788.8550
2 Zimbabwe Africa    1987 62.351   9216418 706.1573
3 Zimbabwe Africa    1992 60.377  10704340 693.4208
4 Zimbabwe Africa    1997 46.809  11404948 792.4500
5 Zimbabwe Africa    2002 39.989  11926563 672.0386
6 Zimbabwe Africa    2007 43.487  12311143 469.7093

In [13]:
summary(gapminder)

        country        continent        year         lifeExp
 Afghanistan:  12   Africa  :624   Min.   :1952   Min.   :23.60
 Albania    :  12   Americas:300   1st Qu.:1966   1st Qu.:48.20
 Algeria    :  12   Asia    :396   Median :1980   Median :60.71
 Angola     :  12   Europe  :360   Mean   :1980   Mean   :59.47
 Argentina  :  12   Oceania : 24   3rd Qu.:1993   3rd Qu.:70.85
 Australia  :  12                  Max.   :2007   Max.   :82.60
 (Other)    :1632
      pop              gdpPercap
 Min.   :6.001e+04   Min.   :   241.2
 1st Qu.:2.794e+06   1st Qu.:  1202.1
 Median :7.024e+06   Median :  3531.8
 Mean   :2.960e+07   Mean   :  7215.3
 3rd Qu.:1.959e+07   3rd Qu.:  9325.5
 Max.   :1.319e+09   Max.   :113523.1

Let's get information about Canada in `gapminder` dataset:

In [14]:
# before this you can View(gapminder) in RStudio to find indexes
austria <- gapminder[73:84, ]
austria

   country continent year lifeExp pop     gdpPercap
1  Austria Europe    1952 66.800  6927772  6137.076
2  Austria Europe    1957 67.480  6965860  8842.598
3  Austria Europe    1962 69.540  7129864 10750.721
4  Austria Europe    1967 70.140  7376998 12834.602
5  Austria Europe    1972 70.630  7544201 16661.626
6  Austria Europe    1977 72.170  7568430 19749.422
7  Austria Europe    1982 73.180  7574613 21597.084
8  Austria Europe    1987 74.940  7578903 23687.826
9  Austria Europe    1992 76.040  7914969 27042.019
10 Austria Europe    1997 77.510  8069876 29095.921
11 Austria Europe    2002 78.980  8148312 32417.608
12 Austria Europe    2007 79.829  8199783 36126.493

Thats not a good idea for analyzing every country by row indexes.

## 2.2. filter() function

`filter()` takes logical expressions and returns the rows for which all are TRUE.

In [64]:
# task: select rows with lifeExp less than 31
filter(gapminder, lifeExp < 31)

  country      continent year lifeExp pop     gdpPercap
1 Afghanistan  Asia      1952 28.801  8425333  779.4453
2 Afghanistan  Asia      1957 30.332  9240934  820.8530
3 Angola       Africa    1952 30.015  4232095 3520.6103
4 Gambia       Africa    1952 30.000   284320  485.2307
5 Rwanda       Africa    1992 23.599  7290203  737.0686
6 Sierra Leone Africa    1952 30.331  2143249  879.7877

In [67]:
# task: select canada only and year after 1980
filter(gapminder, country == "Austria", year > 1980)

  country continent year lifeExp pop      gdpPercap
1 Canada  Americas  1982 75.760  25201900 22898.79
2 Canada  Americas  1987 76.860  26549700 26626.52
3 Canada  Americas  1992 77.950  28523502 26342.88
4 Canada  Americas  1997 78.610  30305843 28954.93
5 Canada  Americas  2002 79.770  31902268 33328.97
6 Canada  Americas  2007 80.653  33390141 36319.24

In [74]:
# task: select canada only and year after 1980
filter(gapminder, country %in% c("Austria", "Belgium"))

   country continent year lifeExp pop      gdpPercap
1  Austria Europe    1952 66.800   6927772  6137.076
2  Austria Europe    1957 67.480   6965860  8842.598
3  Austria Europe    1962 69.540   7129864 10750.721
4  Austria Europe    1967 70.140   7376998 12834.602
5  Austria Europe    1972 70.630   7544201 16661.626
6  Austria Europe    1977 72.170   7568430 19749.422
7  Austria Europe    1982 73.180   7574613 21597.084
8  Austria Europe    1987 74.940   7578903 23687.826
9  Austria Europe    1992 76.040   7914969 27042.019
10 Austria Europe    1997 77.510   8069876 29095.921
11 Austria Europe    2002 78.980   8148312 32417.608
12 Austria Europe    2007 79.829   8199783 36126.493
13 Belgium Europe    1952 68.000   8730405  8343.105
14 Belgium Europe    1957 69.240   8989111  9714.961
15 Belgium Europe    1962 70.250   9218400 10991.207
16 Belgium Europe    1967 70.940   9556500 13149.041
17 Belgium Europe    1972 71.440   9709100 16672.144
18 Belgium Europe    1977 72.800   9821800 19117.974
19 Belgium Europe    1982 73.930   9856303 20979.846
20 Belgium Europe    1987 75.350   9870200 22525.563
21 Belgium Europe    1992 76.460  10045622 25575.571
22 Belgium Europe    1997 77.530  10199787 27561.197
23 Belgium Europe    2002 78.320  10311970 30485.884
24 Belgium Europe    2007 79.441  10392226 33692.605

Lets rewrite initial code:

In [15]:
austria <- filter(gapminder, country == "Austria")
austria

   country continent year lifeExp pop     gdpPercap
1  Austria Europe    1952 66.800  6927772  6137.076
2  Austria Europe    1957 67.480  6965860  8842.598
3  Austria Europe    1962 69.540  7129864 10750.721
4  Austria Europe    1967 70.140  7376998 12834.602
5  Austria Europe    1972 70.630  7544201 16661.626
6  Austria Europe    1977 72.170  7568430 19749.422
7  Austria Europe    1982 73.180  7574613 21597.084
8  Austria Europe    1987 74.940  7578903 23687.826
9  Austria Europe    1992 76.040  7914969 27042.019
10 Austria Europe    1997 77.510  8069876 29095.921
11 Austria Europe    2002 78.980  8148312 32417.608
12 Austria Europe    2007 79.829  8199783 36126.493

## 2.3. Pipe (%>%) operator

`%>%` is `pipe` operator. The pipe operator takes the thing on the left-hand-side and pipes it into the function call on the right-hand-side – literally, drops it in as the first argument.

`head()` function without pipe and top 4 items:

> In R version before 4.1.0 `pipe` `%>%` operator is not a language build-in and you should install `magrittr` package:

In [17]:
#install.packages("magrittr") # for pipe %>% operator
library(magrittr)

In [18]:
head(gapminder, n = 4)

  country     continent year lifeExp pop      gdpPercap
1 Afghanistan Asia      1952 28.801   8425333 779.4453
2 Afghanistan Asia      1957 30.332   9240934 820.8530
3 Afghanistan Asia      1962 31.997  10267083 853.1007
4 Afghanistan Asia      1967 34.020  11537966 836.1971

`head()` function with pipe and top 4 items:

In [19]:
gapminder %>% head(4)

  country     continent year lifeExp pop      gdpPercap
1 Afghanistan Asia      1952 28.801   8425333 779.4453
2 Afghanistan Asia      1957 30.332   9240934 820.8530
3 Afghanistan Asia      1962 31.997  10267083 853.1007
4 Afghanistan Asia      1967 34.020  11537966 836.1971

Output is the same. So, let's rewrire filtering for `Austria` with pipe:

In [20]:
austria <- gapminder %>% filter(country == "Austria")
austria

   country continent year lifeExp pop     gdpPercap
1  Austria Europe    1952 66.800  6927772  6137.076
2  Austria Europe    1957 67.480  6965860  8842.598
3  Austria Europe    1962 69.540  7129864 10750.721
4  Austria Europe    1967 70.140  7376998 12834.602
5  Austria Europe    1972 70.630  7544201 16661.626
6  Austria Europe    1977 72.170  7568430 19749.422
7  Austria Europe    1982 73.180  7574613 21597.084
8  Austria Europe    1987 74.940  7578903 23687.826
9  Austria Europe    1992 76.040  7914969 27042.019
10 Austria Europe    1997 77.510  8069876 29095.921
11 Austria Europe    2002 78.980  8148312 32417.608
12 Austria Europe    2007 79.829  8199783 36126.493

In [22]:
# add more conditions in filter
austria <- gapminder %>% filter(country == "Austria", year > 2000)
austria

  country continent year lifeExp pop     gdpPercap
1 Austria Europe    2002 78.980  8148312 32417.61
2 Austria Europe    2007 79.829  8199783 36126.49

---

### Task 1. Create dataframe color_data:

In [26]:
# Let's explore data with simple dataset `color_data`.
color_data <- data.frame(color = c("red", "green", "red", "green", "green"),
                          value = 1:5)
color_data

  color value
1 red   1
2 green 2
3 red   3
4 green 4
5 green 5

In [27]:
# Get only records with "green":
color_data %>% filter(color == "green")

  color value
1 green 2
2 green 4
3 green 5

In [28]:
# Get only records value >= 3
color_data %>% filter(value >= 3)

  color value
1 red   3
2 green 4
3 green 5

In [29]:
# Get only records value c(1,3,5)
color_data %>% filter(value %in% c(1,3,5))

  color value
1 red   1
2 red   3
3 green 5

## 2.4. `select` function

Use `select()` to subset the data on variables/columns by `names` or `index`. You also can define order of columns with `select()`.

In [30]:
select(gapminder, year, country, pop)

     year country     pop
1    1952 Afghanistan  8425333
2    1957 Afghanistan  9240934
3    1962 Afghanistan 10267083
4    1967 Afghanistan 11537966
5    1972 Afghanistan 13079460
6    1977 Afghanistan 14880372
7    1982 Afghanistan 12881816
8    1987 Afghanistan 13867957
9    1992 Afghanistan 16317921
10   1997 Afghanistan 22227415
11   2002 Afghanistan 25268405
12   2007 Afghanistan 31889923
13   1952 Albania      1282697
14   1957 Albania      1476505
15   1962 Albania      1728137
16   1967 Albania      1984060
17   1972 Albania      2263554
18   1977 Albania      2509048
19   1982 Albania      2780097
20   1987 Albania      3075321
21   1992 Albania      3326498
22   1997 Albania      3428038
23   2002 Albania      3508512
24   2007 Albania      3600523
25   1952 Algeria      9279525
26   1957 Algeria     10270856
27   1962 Algeria     11000948
28   1967 Algeria     12760499
29   1972 Algeria     14760787
30   1977 Algeria     17152804
...  ...  ...         ...
1675 1982 Yemen, Rep.  9657618
1676 1987 Yemen, Rep. 11219340
1677 1992 Yemen, Rep. 13367997
1678 1997 Yemen, Rep. 15826497
1679 2002 Yemen, Rep. 18701257
1680 2007 Yemen, Rep. 22211743
1681 1952 Zambia       2672000
1682 1957 Zambia       3016000
1683 1962 Zambia       3421000
1684 1967 Zambia       3900000
1685 1972 Zambia       4506497
1686 1977 Zambia       5216550
1687 1982 Zambia       6100407
1688 1987 Zambia       7272406
1689 1992 Zambia       8381163
1690 1997 Zambia       9417789
1691 2002 Zambia      10595811
1692 2007 Zambia      11746035
1693 1952 Zimbabwe     3080907
1694 1957 Zimbabwe     3646340
1695 1962 Zimbabwe     4277736
1696 1967 Zimbabwe     4995432
1697 1972 Zimbabwe     5861135
1698 1977 Zimbabwe     6642107
1699 1982 Zimbabwe     7636524
1700 1987 Zimbabwe     9216418
1701 1992 Zimbabwe    10704340
1702 1997 Zimbabwe    11404948
1703 2002 Zimbabwe    11926563
1704 2007 Zimbabwe    12311143

Lets combine few functions with `pipe` (`%>%`):

In [31]:
gapminder %>%
    select(year, country, pop, lifeExp) %>%
    head(4)

  year country     pop      lifeExp
1 1952 Afghanistan  8425333 28.801
2 1957 Afghanistan  9240934 30.332
3 1962 Afghanistan 10267083 31.997
4 1967 Afghanistan 11537966 34.020

Finally, lest extend our filtering:

In [32]:
austria <- gapminder %>% 
                filter(country == "Austria") %>%
                select(year, pop, lifeExp)
austria

   year pop     lifeExp
1  1952 6927772 66.800
2  1957 6965860 67.480
3  1962 7129864 69.540
4  1967 7376998 70.140
5  1972 7544201 70.630
6  1977 7568430 72.170
7  1982 7574613 73.180
8  1987 7578903 74.940
9  1992 7914969 76.040
10 1997 8069876 77.510
11 2002 8148312 78.980
12 2007 8199783 79.829

In [33]:
# compare dplyr syntax with base R call
gapminder[gapminder$country == "Austria", c("year", "pop", "lifeExp")]

   year pop     lifeExp
1  1952 6927772 66.800
2  1957 6965860 67.480
3  1962 7129864 69.540
4  1967 7376998 70.140
5  1972 7544201 70.630
6  1977 7568430 72.170
7  1982 7574613 73.180
8  1987 7578903 74.940
9  1992 7914969 76.040
10 1997 8069876 77.510
11 2002 8148312 78.980
12 2007 8199783 79.829

You can remove some columns using `minus`(operator) and add few filter conditions:

In [34]:
austria <- gapminder %>% 
                filter(country == "Austria", year > 2000) %>%
                select(-continent, -gdpPercap) %>%
                head()
austria

  country year lifeExp pop
1 Austria 2002 78.980  8148312
2 Austria 2007 79.829  8199783

You can insert different conditions about columns you need to `select`.

In [37]:
gapminder %>%
    select(!where(is.numeric))  # its 1704 records, because of repeating some records

     country     continent
1    Afghanistan Asia
2    Afghanistan Asia
3    Afghanistan Asia
4    Afghanistan Asia
5    Afghanistan Asia
6    Afghanistan Asia
7    Afghanistan Asia
8    Afghanistan Asia
9    Afghanistan Asia
10   Afghanistan Asia
11   Afghanistan Asia
12   Afghanistan Asia
13   Albania     Europe
14   Albania     Europe
15   Albania     Europe
16   Albania     Europe
17   Albania     Europe
18   Albania     Europe
19   Albania     Europe
20   Albania     Europe
21   Albania     Europe
22   Albania     Europe
23   Albania     Europe
24   Albania     Europe
25   Algeria     Africa
26   Algeria     Africa
27   Algeria     Africa
28   Algeria     Africa
29   Algeria     Africa
30   Algeria     Africa
...  ...         ...
1675 Yemen, Rep. Asia
1676 Yemen, Rep. Asia
1677 Yemen, Rep. Asia
1678 Yemen, Rep. Asia
1679 Yemen, Rep. Asia
1680 Yemen, Rep. Asia
1681 Zambia      Africa
1682 Zambia      Africa
1683 Zambia      Africa
1684 Zambia      Africa
1685 Zambia      Africa
1686 Zambia      Africa
1687 Zambia      Africa
1688 Zambia      Africa
1689 Zambia      Africa
1690 Zambia      Africa
1691 Zambia      Africa
1692 Zambia      Africa
1693 Zimbabwe    Africa
1694 Zimbabwe    Africa
1695 Zimbabwe    Africa
1696 Zimbabwe    Africa
1697 Zimbabwe    Africa
1698 Zimbabwe    Africa
1699 Zimbabwe    Africa
1700 Zimbabwe    Africa
1701 Zimbabwe    Africa
1702 Zimbabwe    Africa
1703 Zimbabwe    Africa
1704 Zimbabwe    Africa

Let's output all unique pairs `continent -> country` with `distinct()` function:

In [80]:
gapminder %>%
    select(!where(is.numeric)) %>%
    distinct() # its 142 records now

    country                  continent
1   Afghanistan              Asia
2   Albania                  Europe
3   Algeria                  Africa
4   Angola                   Africa
5   Argentina                Americas
6   Australia                Oceania
7   Austria                  Europe
8   Bahrain                  Asia
9   Bangladesh               Asia
10  Belgium                  Europe
11  Benin                    Africa
12  Bolivia                  Americas
13  Bosnia and Herzegovina   Europe
14  Botswana                 Africa
15  Brazil                   Americas
16  Bulgaria                 Europe
17  Burkina Faso             Africa
18  Burundi                  Africa
19  Cambodia                 Asia
20  Cameroon                 Africa
21  Canada                   Americas
22  Central African Republic Africa
23  Chad                     Africa
24  Chile                    Americas
25  China                    Asia
26  Colombia                 Americas
27  Comoros                  Africa
28  Congo, Dem. Rep.         Africa
29  Congo, Rep.              Africa
30  Costa Rica               Americas
... ...                      ...
113 Sierra Leone             Africa
114 Singapore                Asia
115 Slovak Republic          Europe
116 Slovenia                 Europe
117 Somalia                  Africa
118 South Africa             Africa
119 Spain                    Europe
120 Sri Lanka                Asia
121 Sudan                    Africa
122 Swaziland                Africa
123 Sweden                   Europe
124 Switzerland              Europe
125 Syria                    Asia
126 Taiwan                   Asia
127 Tanzania                 Africa
128 Thailand                 Asia
129 Togo                     Africa
130 Trinidad and Tobago      Americas
131 Tunisia                  Africa
132 Turkey                   Europe
133 Uganda                   Africa
134 United Kingdom           Europe
135 United States            Americas
136 Uruguay                  Americas
137 Venezuela                Americas
138 Vietnam                  Asia
139 West Bank and Gaza       Asia
140 Yemen, Rep.              Asia
141 Zambia                   Africa
142 Zimbabwe                 Africa

---

## 2.5. Selecting random $N$ rows

The `sample_n()` function selects random rows from a data frame

In [127]:
gapminder %>% sample_n(5)

  country            continent year lifeExp pop      gdpPercap
1 Libya              Africa    1962 47.808   1441863 6757.031
2 Botswana           Africa    1997 52.556   1536536 8647.142
3 Swaziland          Africa    1957 43.424    326741 1244.708
4 Dominican Republic Americas  1997 69.957   7992357 3614.101
5 Iraq               Asia      2002 57.046  24001816 4390.717

If you want make `pseudo-random generation` reprodusable use `set.seed()`. Seed is start point of random generation. Different seeds give different output.

In [128]:
set.seed(2021) # example, seed = 2021

The `sample_frac()` function selects random fraction rows from a data frame.
Let's select $1\%$ of data

In [40]:
set.seed(2021) # output not changing, uncomment it 
gapminder %>% sample_frac(0.01)

   country             continent year lifeExp pop      gdpPercap
1  Libya               Africa    1962 47.808   1441863  6757.0308
2  Botswana            Africa    1997 52.556   1536536  8647.1423
3  Swaziland           Africa    1957 43.424    326741  1244.7084
4  Dominican Republic  Americas  1997 69.957   7992357  3614.1013
5  Iraq                Asia      2002 57.046  24001816  4390.7173
6  Libya               Africa    1987 66.234   3799845 11770.5898
7  Montenegro          Europe    1967 67.178    501035  5907.8509
8  New Zealand         Oceania   1957 70.260   2229407 12247.3953
9  Bulgaria            Europe    2007 73.005   7322858 10680.7928
10 Malawi              Africa    1997 47.495  10419991   692.2758
11 Venezuela           Americas  1977 67.456  13503563 13143.9510
12 Guinea              Africa    1997 51.455   8048834   869.4498
13 Congo, Dem. Rep.    Africa    1952 39.143  14100005   780.5423
14 Eritrea             Africa    1962 40.158   1666618   380.9958
15 Bangladesh          Asia      1982 50.009  93074406   676.9819
16 Cote d'Ivoire       Africa    1952 40.477   2977019  1388.5947
17 Trinidad and Tobago Americas  2002 68.976   1101832 11460.6002

## 2.6. Subset rows using their positions with `slice()`

### Description

- [x] `slice()` lets you index rows by their (integer) locations. It allows you to select, remove, and duplicate rows. It is accompanied by a number of helpers for common use cases:
- [x] `slice_head()` and `slice_tail()` select the first or last rows.
- [x] `slice_sample()` randomly selects rows.
- [x] `slice_min()` and `slice_max()` select rows with highest or lowest values of a variable.

If `.data` is a grouped_df, the operation will be performed on each group, so that (e.g.) `slice_head(df, n = 5)` will select the first five rows in each group.

### Samples

In [81]:
gapminder %>% slice(1) # top 1 row

  country     continent year lifeExp pop     gdpPercap
1 Afghanistan Asia      1952 28.801  8425333 779.4453

In [55]:
gapminder %>% slice(1:6) # top n = 6

  country     continent year lifeExp pop      gdpPercap
1 Afghanistan Asia      1952 28.801   8425333 779.4453
2 Afghanistan Asia      1957 30.332   9240934 820.8530
3 Afghanistan Asia      1962 31.997  10267083 853.1007
4 Afghanistan Asia      1967 34.020  11537966 836.1971
5 Afghanistan Asia      1972 36.088  13079460 739.9811
6 Afghanistan Asia      1977 38.438  14880372 786.1134

In [65]:
gapminder %>% slice_head(n = 6) # works like head()

  country     continent year lifeExp pop      gdpPercap
1 Afghanistan Asia      1952 28.801   8425333 779.4453
2 Afghanistan Asia      1957 30.332   9240934 820.8530
3 Afghanistan Asia      1962 31.997  10267083 853.1007
4 Afghanistan Asia      1967 34.020  11537966 836.1971
5 Afghanistan Asia      1972 36.088  13079460 739.9811
6 Afghanistan Asia      1977 38.438  14880372 786.1134

In [67]:
gapminder %>% slice_tail(n = 5) # works like tail()

  country  continent year lifeExp pop      gdpPercap
1 Zimbabwe Africa    1987 62.351   9216418 706.1573
2 Zimbabwe Africa    1992 60.377  10704340 693.4208
3 Zimbabwe Africa    1997 46.809  11404948 792.4500
4 Zimbabwe Africa    2002 39.989  11926563 672.0386
5 Zimbabwe Africa    2007 43.487  12311143 469.7093

**You can drop some recods with negative indexes:**

In [73]:
gapminder %>% slice(-c(1:3,5)) %>% # remove Afganistan years 1952, 1957, 1962 and 1972 
    head(6)

  country     continent year lifeExp pop      gdpPercap
1 Afghanistan Asia      1967 34.020  11537966 836.1971
2 Afghanistan Asia      1977 38.438  14880372 786.1134
3 Afghanistan Asia      1982 39.854  12881816 978.0114
4 Afghanistan Asia      1987 40.822  13867957 852.3959
5 Afghanistan Asia      1992 41.674  16317921 649.3414
6 Afghanistan Asia      1997 41.763  22227415 635.3414

In [82]:
# Random rows selection with slice_sample()
gapminder %>% slice_sample(n = 5) #use set.seed() to fix random

  country       continent year lifeExp pop       gdpPercap
1 Iceland       Europe    1977 76.110     221823 19654.9625
2 United States Americas  1962 70.210  186538000 16173.1459
3 Haiti         Americas  1982 51.461    5198399  2011.1595
4 Eritrea       Africa    1997 53.378    4058319   913.4708
5 Egypt         Africa    1987 59.797   52799062  3885.4607

In [83]:
# Rows with minimum and maximum values of a variable
# Lets find top 5 records with minimum and maximum lifeExp in all dataset
gapminder %>% slice_min(lifeExp, n = 5)
gapminder %>% slice_max(lifeExp, n = 5)

  country      continent year lifeExp pop     gdpPercap
1 Rwanda       Africa    1992 23.599  7290203  737.0686
2 Afghanistan  Asia      1952 28.801  8425333  779.4453
3 Gambia       Africa    1952 30.000   284320  485.2307
4 Angola       Africa    1952 30.015  4232095 3520.6103
5 Sierra Leone Africa    1952 30.331  2143249  879.7877

  country          continent year lifeExp pop       gdpPercap
1 Japan            Asia      2007 82.603  127467972 31656.07
2 Hong Kong, China Asia      2007 82.208    6980412 39724.98
3 Japan            Asia      2002 82.000  127065841 28604.59
4 Iceland          Europe    2007 81.757     301931 36180.79
5 Switzerland      Europe    2007 81.701    7554661 37506.42

---

## 2.7. Sorting with  **`arrange()`**

`arrange(.data, …)` function order rows by values of a column or columns (low to high)You can use with `desc()` to order from high to low. 

For example, we need to select top 10 countries in 2002  by lifeExp variable.

In [85]:
data2002 <- gapminder %>% 
                filter(year == 2002) %>%
                top_n(10, lifeExp) # select top 10 by lifeExp value
data2002

   country          continent year lifeExp pop       gdpPercap
1  Australia        Oceania   2002 80.370   19546792 30687.75
2  Canada           Americas  2002 79.770   31902268 33328.97
3  Hong Kong, China Asia      2002 81.495    6762476 30209.02
4  Iceland          Europe    2002 80.500     288030 31163.20
5  Israel           Asia      2002 79.696    6029529 21905.60
6  Italy            Europe    2002 80.240   57926999 27968.10
7  Japan            Asia      2002 82.000  127065841 28604.59
8  Spain            Europe    2002 79.780   40152517 24835.47
9  Sweden           Europe    2002 80.040    8954175 29341.63
10 Switzerland      Europe    2002 80.620    7361757 34480.96

In [86]:
# sort by pop
data2002 %>% arrange(pop)

   country          continent year lifeExp pop       gdpPercap
1  Iceland          Europe    2002 80.500     288030 31163.20
2  Israel           Asia      2002 79.696    6029529 21905.60
3  Hong Kong, China Asia      2002 81.495    6762476 30209.02
4  Switzerland      Europe    2002 80.620    7361757 34480.96
5  Sweden           Europe    2002 80.040    8954175 29341.63
6  Australia        Oceania   2002 80.370   19546792 30687.75
7  Canada           Americas  2002 79.770   31902268 33328.97
8  Spain            Europe    2002 79.780   40152517 24835.47
9  Italy            Europe    2002 80.240   57926999 27968.10
10 Japan            Asia      2002 82.000  127065841 28604.59

In [87]:
# sort by pop from high to low
data2002 %>% arrange(desc(pop))

   country          continent year lifeExp pop       gdpPercap
1  Japan            Asia      2002 82.000  127065841 28604.59
2  Italy            Europe    2002 80.240   57926999 27968.10
3  Spain            Europe    2002 79.780   40152517 24835.47
4  Canada           Americas  2002 79.770   31902268 33328.97
5  Australia        Oceania   2002 80.370   19546792 30687.75
6  Sweden           Europe    2002 80.040    8954175 29341.63
7  Switzerland      Europe    2002 80.620    7361757 34480.96
8  Hong Kong, China Asia      2002 81.495    6762476 30209.02
9  Israel           Asia      2002 79.696    6029529 21905.60
10 Iceland          Europe    2002 80.500     288030 31163.20

---

## 2.7. Make new variables with **`mutate()`**

`mutate(.data, …)` compute new column(s). 
Lets compute new column for `data2002` $gdpTotal = gdpPercap * pop / 1000000$.

In [168]:
data2002 <- data2002 %>% mutate(gdpTotal = gdpPercap * pop)
data2002

   country          continent year lifeExp pop       gdpPercap gdpTotal
1  Australia        Oceania   2002 80.370   19546792 30687.75  5.998472e+11
2  Canada           Americas  2002 79.770   31902268 33328.97  1.063270e+12
3  Hong Kong, China Asia      2002 81.495    6762476 30209.02  2.042877e+11
4  Iceland          Europe    2002 80.500     288030 31163.20  8.975937e+09
5  Israel           Asia      2002 79.696    6029529 21905.60  1.320804e+11
6  Italy            Europe    2002 80.240   57926999 27968.10  1.620108e+12
7  Japan            Asia      2002 82.000  127065841 28604.59  3.634667e+12
8  Spain            Europe    2002 79.780   40152517 24835.47  9.972067e+11
9  Sweden           Europe    2002 80.040    8954175 29341.63  2.627301e+11
10 Switzerland      Europe    2002 80.620    7361757 34480.96  2.538404e+11

`transmute(.data, …)` compute new column(s), drop others.

In [171]:
data2002 %>% transmute(gdpTotal = gdpPercap * pop)

   gdpTotal
1  5.998472e+11
2  1.063270e+12
3  2.042877e+11
4  8.975937e+09
5  1.320804e+11
6  1.620108e+12
7  3.634667e+12
8  9.972067e+11
9  2.627301e+11
10 2.538404e+11

You can `mutate` many columns at once:

In [198]:
data2002 <- data2002 %>% 
                mutate(gdpTotal = gdpPercap * pop,
                      countryUpper = toupper(country), # uppercase country
                      lifeExpRounded = round(lifeExp)) # rounded life expectation in 
data2002

   country          continent year lifeExp pop       gdpPercap gdpTotal
1  Australia        Oceania   2002 80.370   19546792 30687.75  5.998472e+11
2  Canada           Americas  2002 79.770   31902268 33328.97  1.063270e+12
3  Hong Kong, China Asia      2002 81.495    6762476 30209.02  2.042877e+11
4  Iceland          Europe    2002 80.500     288030 31163.20  8.975937e+09
5  Israel           Asia      2002 79.696    6029529 21905.60  1.320804e+11
6  Italy            Europe    2002 80.240   57926999 27968.10  1.620108e+12
7  Japan            Asia      2002 82.000  127065841 28604.59  3.634667e+12
8  Spain            Europe    2002 79.780   40152517 24835.47  9.972067e+11
9  Sweden           Europe    2002 80.040    8954175 29341.63  2.627301e+11
10 Switzerland      Europe    2002 80.620    7361757 34480.96  2.538404e+11
   countryUpper     lifeExpRounded
1  AUSTRALIA        80
2  CANADA           80
3  HONG KONG, CHINA 81
4  ICELAND          80
5  ISRAEL           80
6  ITALY            80
7  JAPAN            82
8  SPAIN            80
9  SWEDEN           80
10 SWITZERLAND      81

You also can edit existing column (let's change `continent Europe` to `EU` in dataframe):

In [202]:
data2002 %>%     
    mutate(
        continent = as.character(continent), # convert factor -> character 
        continent = ifelse(continent == "Europe", "EU", continent))

   country          continent year lifeExp pop       gdpPercap gdpTotal
1  Australia        Oceania   2002 80.370   19546792 30687.75  5.998472e+11
2  Canada           Americas  2002 79.770   31902268 33328.97  1.063270e+12
3  Hong Kong, China Asia      2002 81.495    6762476 30209.02  2.042877e+11
4  Iceland          EU        2002 80.500     288030 31163.20  8.975937e+09
5  Israel           Asia      2002 79.696    6029529 21905.60  1.320804e+11
6  Italy            EU        2002 80.240   57926999 27968.10  1.620108e+12
7  Japan            Asia      2002 82.000  127065841 28604.59  3.634667e+12
8  Spain            EU        2002 79.780   40152517 24835.47  9.972067e+11
9  Sweden           EU        2002 80.040    8954175 29341.63  2.627301e+11
10 Switzerland      EU        2002 80.620    7361757 34480.96  2.538404e+11
   countryUpper     lifeExpRounded
1  AUSTRALIA        80
2  CANADA           80
3  HONG KONG, CHINA 81
4  ICELAND          80
5  ISRAEL           80
6  ITALY            80
7  JAPAN            82
8  SPAIN            80
9  SWEDEN           80
10 SWITZERLAND      81

## 2.8. Renaming columns with **`rename()`**

`rename(.data, …)` rename columns.
Let's rename column `pop` to poulation:

In [1]:
data2002_renamed <- data2002 %>% 
                rename(population = pop) %>%
                select(1:5)
data2002_renamed

ERROR: Error in data2002 %>% rename(population = pop) %>% select(1:5): could not find function "%>%"

---

## 2.9. Calculations with **`group_by()`** + **`summarise()`**

`group_by(.data, ..., add = FALSE)` returns copy of table grouped by defined columns.

Let's find average by `lifeExp` for each `continent` in `2002` (ouput is `continent`, `lifeExpAvg2002`, `countriesCount`, `year = 2002`):

In [212]:
grouped_data2002 <- gapminder %>%
            filter(year == 2002) %>% # year
            group_by(continent) %>% # grouping condition
            summarise(
                lifeExpAvg2002 = mean(lifeExp),
                countriesCount = n() # n() count of rows in group                
            ) %>%
            mutate(year = 2002)
grouped_data2002

  continent lifeExpAvg2002 countriesCount year
1 Africa    53.32523       52             2002
2 Americas  72.42204       25             2002
3 Asia      69.23388       33             2002
4 Europe    76.70060       30             2002
5 Oceania   79.74000        2             2002

Let's find total `population` for each `continent` in `2002` (ouput is `continent`, `totalPop`, `year`):

In [211]:
grouped_data2002pop <- gapminder %>%
            filter(year == 2002) %>% # year
            group_by(continent) %>% # grouping condition
            summarise(
                totalPop = sum(pop)            
            ) %>%
            mutate(year = 2002)
grouped_data2002pop

  continent totalPop   year
1 Africa     833723916 2002
2 Americas   849772762 2002
3 Asia      3601802203 2002
4 Europe     578223869 2002
5 Oceania     23454829 2002

There are additional variations of `summarise()`:

- [x] `summarise_all()` - Apply funs to every column. 
- [x] `summarise_at()` - Apply funs to specific columns.  
- [x] `summarise_if()` - Apply funs to all cols of one type.

---

## 2.10. Binding rows and columns

`bind_rows(.data, …)` helps to unite two dataframes with the same columns order and names.

So, if we need add one data frame to an other vertically (bind rows) we shoul use `bind_rows`:

In [217]:
grouped_data2002 <- gapminder %>%
            filter(year == 2002) %>% # year
            group_by(continent) %>% # grouping condition
            summarise(
                lifeExpAvg = mean(lifeExp),
                countriesCount = n() # n() count of rows in group                
            ) %>%
            mutate(year = 2002)
grouped_data2002

  continent lifeExpAvg countriesCount year
1 Africa    53.32523   52             2002
2 Americas  72.42204   25             2002
3 Asia      69.23388   33             2002
4 Europe    76.70060   30             2002
5 Oceania   79.74000    2             2002

In [219]:
grouped_data2007 <- gapminder %>%
            filter(year == 2007) %>% # year
            group_by(continent) %>% # grouping condition
            summarise(
                lifeExpAvg = mean(lifeExp),
                countriesCount = n() # n() count of rows in group                
            ) %>%
            mutate(year = 2007)
grouped_data2007

  continent lifeExpAvg countriesCount year
1 Africa    54.80604   52             2007
2 Americas  73.60812   25             2007
3 Asia      70.72848   33             2007
4 Europe    77.64860   30             2007
5 Oceania   80.71950    2             2007

Unite them:

In [221]:
grouped_data <- grouped_data2002 %>%
                    bind_rows(grouped_data2007)
grouped_data

   continent lifeExpAvg countriesCount year
1  Africa    53.32523   52             2002
2  Americas  72.42204   25             2002
3  Asia      69.23388   33             2002
4  Europe    76.70060   30             2002
5  Oceania   79.74000    2             2002
6  Africa    54.80604   52             2007
7  Americas  73.60812   25             2007
8  Asia      70.72848   33             2007
9  Europe    77.64860   30             2007
10 Oceania   80.71950    2             2007

`bind_cols(.data, …)` helps to unite two dataframes with the same rows count.

In [224]:
grouped_data2002pop <- gapminder %>%
            filter(year == 2002) %>% # year
            group_by(continent) %>% # grouping condition
            summarise(
                totalPop = sum(pop)            
            ) %>%
            mutate(year = 2002)
grouped_data2002pop

  continent totalPop   year
1 Africa     833723916 2002
2 Americas   849772762 2002
3 Asia      3601802203 2002
4 Europe     578223869 2002
5 Oceania     23454829 2002

Let's combine `grouped_data2002` and `popgrouped_data2002pop`:

In [228]:
grouped_data <- grouped_data2002 %>% 
                    bind_cols(grouped_data2002pop)
grouped_data

# columns with the same name were renamed!

New names:
* continent -> continent...1
* year -> year...4
* continent -> continent...5
* year -> year...7

  continent...1 lifeExpAvg countriesCount year...4 continent...5 totalPop
1 Africa        53.32523   52             2002     Africa         833723916
2 Americas      72.42204   25             2002     Americas       849772762
3 Asia          69.23388   33             2002     Asia          3601802203
4 Europe        76.70060   30             2002     Europe         578223869
5 Oceania       79.74000    2             2002     Oceania         23454829
  year...7
1 2002
2 2002
3 2002
4 2002
5 2002

You can remove same named variables before binding:

In [231]:
grouped_data <- grouped_data2002 %>% 
                    bind_cols(grouped_data2002pop %>%
                                select(-continent, -year))
grouped_data

# better, but continents order is not the same in both frames 
# your data is going to be damaged

  continent lifeExpAvg countriesCount year totalPop
1 Africa    53.32523   52             2002  833723916
2 Americas  72.42204   25             2002  849772762
3 Asia      69.23388   33             2002 3601802203
4 Europe    76.70060   30             2002  578223869
5 Oceania   79.74000    2             2002   23454829

In [88]:
grouped_data2002pop <- grouped_data2002pop %>% arrange(totalPop)

grouped_data <- grouped_data2002 %>% 
                    bind_cols(grouped_data2002pop)
grouped_data

# you can see that continent fields different in the same row

ERROR: Error in arrange(., totalPop): object 'grouped_data2002pop' not found

---

## 2.11. `Join()`ing data

To solve previous problem you can use set of `join()`-functions. `left_join()` can solve our previous example:

In [236]:
grouped_data2002pop <- grouped_data2002pop %>% arrange(totalPop)

grouped_data <- grouped_data2002 %>% 
                    left_join(grouped_data2002pop, by = "continent")
grouped_data

# but we have duplicated year

  continent lifeExpAvg countriesCount year.x totalPop   year.y
1 Africa    53.32523   52             2002    833723916 2002
2 Americas  72.42204   25             2002    849772762 2002
3 Asia      69.23388   33             2002   3601802203 2002
4 Europe    76.70060   30             2002    578223869 2002
5 Oceania   79.74000    2             2002     23454829 2002

In [239]:
grouped_data2002pop <- grouped_data2002pop %>% arrange(totalPop)

grouped_data <- grouped_data2002 %>% 
                    left_join(grouped_data2002pop, by = c("continent", "year"))
grouped_data

#ok

  continent lifeExpAvg countriesCount year totalPop
1 Africa    53.32523   52             2002  833723916
2 Americas  72.42204   25             2002  849772762
3 Asia      69.23388   33             2002 3601802203
4 Europe    76.70060   30             2002  578223869
5 Oceania   79.74000    2             2002   23454829

Let's make a different data sets for testing `join()` fucntions:

In [241]:
first_df <- data.frame(Letter = c("A", "B", "C", "D", "E"),
                      Value = c(1:5))

second_df <- data.frame(Letter = c("A", "B", "C", "D", "F"),
                      Value = c(12, 7, 4, 1, 5))
first_df
second_df

  Letter Value
1 A      1
2 B      2
3 C      3
4 D      4
5 E      5

  Letter Value
1 A      12
2 B       7
3 C       4
4 D       1
5 F       5

You can see that the last row `Letter` is different in dataframes. `left_join()` test is next.

In [246]:
first_df %>% left_join(second_df, by = "Letter")

# there is no F letter, becouse first_db joined only known first_df Letters.

  Letter Value.x Value.y
1 A      1       12
2 B      2        7
3 C      3        4
4 D      4        1
5 E      5       NA

In [248]:
first_df %>% right_join(second_df, by = "Letter")

# right_join! there is no E letter, becouse first_db joined only known second_df Letters.

  Letter Value.x Value.y
1 A       1      12
2 B       2       7
3 C       3       4
4 D       4       1
5 F      NA       5

In [251]:
first_df %>% inner_join(second_df, by = "Letter")

# inner_join! there is no E and F Letters, 
# only known both first_df and second_df are left here.

  Letter Value.x Value.y
1 A      1       12
2 B      2        7
3 C      3        4
4 D      4        1

In [301]:
first_df %>% full_join(second_df, by = "Letter")

# all are here, but unknown values replaced by NA, it's ok.

  Letter Value.x Value.y
1 A       1      12
2 B       2       7
3 C       3       4
4 D       4       1
5 E       5      NA
6 F      NA       5

Short description of reviewed functions:

|Function|Objectives|Arguments|Multiple keys|
|---|---|---|---|
|`left_join()`|Merge two datasets. Keep all observations from the origin table|	data, origin, destination, by = "ID" |	origin, destination, by = c("ID", "ID2")|
|`right_join()`|Merge two datasets. Keep all observations from the destination table	|data, origin, destination, by = "ID"	|origin, destination, by = c("ID", "ID2")|
|`inner_join()`|Merge two datasets. Excludes all unmatched rows	|data, origin, destination, by = "ID"|	origin, destination, by = c("ID", "ID2")|
|`full_join()`|Merge two datasets. Keeps all observations|	data, origin, destination, by = "ID"	|origin, destination, by = c("ID", "ID2")|

---

## 2.12. Data cleaning with `gather()`

Some times your data is not in tidy format. Peole can collect data year by year in each column. It's problem to use such data for feature engeniering and building prediction models. Let's generate such data sample (quaterly salary of some people).

In [257]:
not_good_data <- data.frame(Name = c("Nick", "Jake", "Anna", "Jane", "Dina"),
                           q1_2021 = c(12442, 22131, 21343, 22111, 14123),
                           q2_2021 = c(13442, 22871, 20343, 22222, 14456),
                           q3_2021 = c(15482, 22031, 22456, 22444, 14533),
                           q4_2021 = c(14511, 20031, 21741, 22333, 14511))
not_good_data

  Name q1_2021 q2_2021 q3_2021 q4_2021
1 Nick 12442   13442   15482   14511
2 Jake 22131   22871   22031   20031
3 Anna 21343   20343   22456   21741
4 Jane 22111   22222   22444   22333
5 Dina 14123   14456   14533   14511

In [269]:
better_data <- not_good_data %>%
                gather(quater, salary, 2:5)
                # gather(quater, salary, q1_2021:q4_2021) possible code too
better_data

   Name quater  salary
1  Nick q1_2021 12442
2  Jake q1_2021 22131
3  Anna q1_2021 21343
4  Jane q1_2021 22111
5  Dina q1_2021 14123
6  Nick q2_2021 13442
7  Jake q2_2021 22871
8  Anna q2_2021 20343
9  Jane q2_2021 22222
10 Dina q2_2021 14456
11 Nick q3_2021 15482
12 Jake q3_2021 22031
13 Anna q3_2021 22456
14 Jane q3_2021 22444
15 Dina q3_2021 14533
16 Nick q4_2021 14511
17 Jake q4_2021 20031
18 Anna q4_2021 21741
19 Jane q4_2021 22333
20 Dina q4_2021 14511

To make our data tidier `separate()` can split quater column into 2 (`quater` and `year`):

In [320]:
best_data <- better_data %>%
    separate(quater, c("quater", "year"), sep = "_") %>% # separate
    mutate(year = as.integer(year), # convert year to integer
           quater = substr(better_data$quater, 2,2), # trim `q` from start
           quater = as.integer(quater), # convert quater to integer
          ) %>%
    head(10)
best_data

   Name quater year salary
1  Nick 1      2021 12442
2  Jake 1      2021 22131
3  Anna 1      2021 21343
4  Jane 1      2021 22111
5  Dina 1      2021 14123
6  Nick 2      2021 13442
7  Jake 2      2021 22871
8  Anna 2      2021 20343
9  Jane 2      2021 22222
10 Dina 2      2021 14456

The `unite()` function concanates two columns into one:

In [324]:
united_data <- best_data %>%
                unite(Qt, quater, year, sep = "#")
united_data

   Name Qt     salary
1  Nick 1#2021 12442
2  Jake 1#2021 22131
3  Anna 1#2021 21343
4  Jane 1#2021 22111
5  Dina 1#2021 14123
6  Nick 2#2021 13442
7  Jake 2#2021 22871
8  Anna 2#2021 20343
9  Jane 2#2021 22222
10 Dina 2#2021 14456

In [325]:
# if dont want remove old columns use remove param
united_data <- best_data %>%
                unite(Qt, quater, year, sep = "#", remove = F)
united_data

   Name Qt     quater year salary
1  Nick 1#2021 1      2021 12442
2  Jake 1#2021 1      2021 22131
3  Anna 1#2021 1      2021 21343
4  Jane 1#2021 1      2021 22111
5  Dina 1#2021 1      2021 14123
6  Nick 2#2021 2      2021 13442
7  Jake 2#2021 2      2021 22871
8  Anna 2#2021 2      2021 20343
9  Jane 2#2021 2      2021 22222
10 Dina 2#2021 2      2021 14456

If you need to make table like initial use `spread()` function:

In [262]:
not_good_data2 <- better_data %>%
                    spread(quater, salary)
not_good_data2

  Name q1_2021 q2_2021 q3_2021 q4_2021
1 Anna 21343   20343   22456   21741
2 Dina 14123   14456   14533   14511
3 Jake 22131   22871   22031   20031
4 Jane 22111   22222   22444   22333
5 Nick 12442   13442   15482   14511

Let's try to `spread()` feild `pop` of `gapminder` by year:

In [303]:
gapminder %>% select(country, pop, year) %>%
                spread(year, pop) %>%
                head() # for shorter code

# now you can easy send data to your director in excel :)

  country     1952     1957     1962     1967     1972     1977     1982
1 Afghanistan  8425333  9240934 10267083 11537966 13079460 14880372 12881816
2 Albania      1282697  1476505  1728137  1984060  2263554  2509048  2780097
3 Algeria      9279525 10270856 11000948 12760499 14760787 17152804 20033753
4 Angola       4232095  4561361  4826015  5247469  5894858  6162675  7016384
5 Argentina   17876956 19610538 21283783 22934225 24779799 26983828 29341374
6 Australia    8691212  9712569 10794968 11872264 13177000 14074100 15184200
  1987     1992     1997     2002     2007
1 13867957 16317921 22227415 25268405 31889923
2  3075321  3326498  3428038  3508512  3600523
3 23254956 26298373 29072015 31287142 33333216
4  7874230  8735988  9875024 10866106 12420476
5 31620918 33958947 36203463 38331121 40301927
6 16257249 17481977 18565243 19546792 20434176

Functions table:

|Function|Objectives|Arguments|
|---|---|---|
|`gather()`|Transform the data from wide to long|(data, key, value, na.rm = FALSE)|
|`spread()`|Transform the data from long to wide|(data, key, value)|
|`separate()`|Split one variables into two|(data, col, into, sep= "", remove = TRUE)|
|`unite()`|Unite two variables into one|(data, col, conc ,sep= "", remove = TRUE)|

---

## Refences

1. [dplyr: A Grammar of Data Manipulation](https://cran.r-project.org/web/packages/dplyr/index.html) on https://cran.r-project.org/.
2. [Data Transformation with splyr::cheat sheet](https://github.com/rstudio/cheatsheets/blob/master/data-transformation.pdf).
3. [DPLYR TUTORIAL : DATA MANIPULATION (50 EXAMPLES)](https://www.listendata.com/2016/08/dplyr-tutorial.html) by Deepanshu Bhalla.

5. [Dplyr Intro](https://stat545.com/dplyr-intro.html) by Stat 545.
6.[R Dplyr Tutorial: Data Manipulation(Join) & Cleaning(Spread)](https://www.guru99.com/r-dplyr-tutorial.html). Introduction to Data Analysis
7. [Loan Default Prediction. Beginners data set for financial analytics Kaggle](https://www.kaggle.com/kmldas/loan-default-prediction)